---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.TextureAngle
source: html/fc25c8d6-1123-27e1-528d-01820566fb60.htm
---
# Autodesk.Revit.DB.Visual.Wave.TextureAngle Property

The property labeled "Angle" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string TextureAngle { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray3d".